espressif/esp-idf/components/soc/esp32s3/register/soc/efuse_reg.h
/** EFUSE_RD_MAC_SPI_SYS_2_REG register
 *  BLOCK1 data register 2.
 */
#define EFUSE_RD_MAC_SPI_SYS_2_REG (DR_REG_EFUSE_BASE + 0x4c)
/* EFUSE_SPI_PAD_CONF_1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Stores the first part of SPI_PAD_CONF..*/
#define EFUSE_SPI_PAD_CONF_1    0xFFFFFFFF
#define EFUSE_SPI_PAD_CONF_1_M  ((EFUSE_SPI_PAD_CONF_1_V)<<(EFUSE_SPI_PAD_CONF_1_S))
#define EFUSE_SPI_PAD_CONF_1_V  0xFFFFFFFF
#define EFUSE_SPI_PAD_CONF_1_S  0
/** EFUSE_SPI_PAD_CONFIG_D_1 : R; bitpos: [1:0]; default: 0;
 *  SPI_PAD_configure D(D0)
 */
#define EFUSE_SPI_PAD_CONFIG_D_1    0x00000003U
#define EFUSE_SPI_PAD_CONFIG_D_1_M  (EFUSE_SPI_PAD_CONFIG_D_1_V << EFUSE_SPI_PAD_CONFIG_D_1_S)
#define EFUSE_SPI_PAD_CONFIG_D_1_V  0x00000003U
#define EFUSE_SPI_PAD_CONFIG_D_1_S  0
/** EFUSE_SPI_PAD_CONFIG_CS : R; bitpos: [7:2]; default: 0;
 *  SPI_PAD_configure CS
 */
#define EFUSE_SPI_PAD_CONFIG_CS    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_CS_M  (EFUSE_SPI_PAD_CONFIG_CS_V << EFUSE_SPI_PAD_CONFIG_CS_S)
#define EFUSE_SPI_PAD_CONFIG_CS_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_CS_S  2
/** EFUSE_SPI_PAD_CONFIG_HD : R; bitpos: [13:8]; default: 0;
 *  SPI_PAD_configure HD(D3)
 */
#define EFUSE_SPI_PAD_CONFIG_HD    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_HD_M  (EFUSE_SPI_PAD_CONFIG_HD_V << EFUSE_SPI_PAD_CONFIG_HD_S)
#define EFUSE_SPI_PAD_CONFIG_HD_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_HD_S  8
/** EFUSE_SPI_PAD_CONFIG_WP : R; bitpos: [19:14]; default: 0;
 *  SPI_PAD_configure WP(D2)
 */
#define EFUSE_SPI_PAD_CONFIG_WP    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_WP_M  (EFUSE_SPI_PAD_CONFIG_WP_V << EFUSE_SPI_PAD_CONFIG_WP_S)
#define EFUSE_SPI_PAD_CONFIG_WP_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_WP_S  14
/** EFUSE_SPI_PAD_CONFIG_DQS : R; bitpos: [25:20]; default: 0;
 *  SPI_PAD_configure DQS
 */
#define EFUSE_SPI_PAD_CONFIG_DQS    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_DQS_M  (EFUSE_SPI_PAD_CONFIG_DQS_V << EFUSE_SPI_PAD_CONFIG_DQS_S)
#define EFUSE_SPI_PAD_CONFIG_DQS_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_DQS_S  20
/** EFUSE_SPI_PAD_CONFIG_D4 : R; bitpos: [31:26]; default: 0;
 *  SPI_PAD_configure D4
 */
#define EFUSE_SPI_PAD_CONFIG_D4    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D4_M  (EFUSE_SPI_PAD_CONFIG_D4_V << EFUSE_SPI_PAD_CONFIG_D4_S)
#define EFUSE_SPI_PAD_CONFIG_D4_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D4_S  26

/** EFUSE_RD_MAC_SPI_SYS_3_REG register
 *  BLOCK1 data register 3.
 */
#define EFUSE_RD_MAC_SPI_SYS_3_REG (DR_REG_EFUSE_BASE + 0x50)
/** EFUSE_SPI_PAD_CONFIG_D5 : R; bitpos: [5:0]; default: 0;
 *  SPI_PAD_configure D5
 */
#define EFUSE_SPI_PAD_CONFIG_D5    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D5_M  (EFUSE_SPI_PAD_CONFIG_D5_V << EFUSE_SPI_PAD_CONFIG_D5_S)
#define EFUSE_SPI_PAD_CONFIG_D5_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D5_S  0
/** EFUSE_SPI_PAD_CONFIG_D6 : R; bitpos: [11:6]; default: 0;
 *  SPI_PAD_configure D6
 */
#define EFUSE_SPI_PAD_CONFIG_D6    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D6_M  (EFUSE_SPI_PAD_CONFIG_D6_V << EFUSE_SPI_PAD_CONFIG_D6_S)
#define EFUSE_SPI_PAD_CONFIG_D6_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D6_S  6
/** EFUSE_SPI_PAD_CONFIG_D7 : R; bitpos: [17:12]; default: 0;
 *  SPI_PAD_configure D7
 */
#define EFUSE_SPI_PAD_CONFIG_D7    0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D7_M  (EFUSE_SPI_PAD_CONFIG_D7_V << EFUSE_SPI_PAD_CONFIG_D7_S)
#define EFUSE_SPI_PAD_CONFIG_D7_V  0x0000003FU
#define EFUSE_SPI_PAD_CONFIG_D7_S  12
/** EFUSE_WAFER_VERSION_MINOR_LO : R; bitpos: [20:18]; default: 0;
 *  WAFER_VERSION_MINOR least significant bits
 */
#define EFUSE_WAFER_VERSION_MINOR_LO    0x00000007U
#define EFUSE_WAFER_VERSION_MINOR_LO_M  (EFUSE_WAFER_VERSION_MINOR_LO_V << EFUSE_WAFER_VERSION_MINOR_LO_S)
#define EFUSE_WAFER_VERSION_MINOR_LO_V  0x00000007U
#define EFUSE_WAFER_VERSION_MINOR_LO_S  18
/** EFUSE_PKG_VERSION : R; bitpos: [23:21]; default: 0;
 *  Package version
 */
#define EFUSE_PKG_VERSION    0x00000007U
#define EFUSE_PKG_VERSION_M  (EFUSE_PKG_VERSION_V << EFUSE_PKG_VERSION_S)
#define EFUSE_PKG_VERSION_V  0x00000007U
#define EFUSE_PKG_VERSION_S  21
/** EFUSE_BLK_VERSION_MINOR : R; bitpos: [26:24]; default: 0;
 *  BLK_VERSION_MINOR
 */
#define EFUSE_BLK_VERSION_MINOR    0x00000007U
#define EFUSE_BLK_VERSION_MINOR_M  (EFUSE_BLK_VERSION_MINOR_V << EFUSE_BLK_VERSION_MINOR_S)
#define EFUSE_BLK_VERSION_MINOR_V  0x00000007U
#define EFUSE_BLK_VERSION_MINOR_S  24
/** EFUSE_FLASH_CAP : R; bitpos: [29:27]; default: 0;
 *  Flash capacity
 */
#define EFUSE_FLASH_CAP    0x00000007U
#define EFUSE_FLASH_CAP_M  (EFUSE_FLASH_CAP_V << EFUSE_FLASH_CAP_S)
#define EFUSE_FLASH_CAP_V  0x00000007U
#define EFUSE_FLASH_CAP_S  27
/** EFUSE_FLASH_TEMP : R; bitpos: [31:30]; default: 0;
 *  Flash temperature
 */
#define EFUSE_FLASH_TEMP    0x00000003U
#define EFUSE_FLASH_TEMP_M  (EFUSE_FLASH_TEMP_V << EFUSE_FLASH_TEMP_S)
#define EFUSE_FLASH_TEMP_V  0x00000003U
#define EFUSE_FLASH_TEMP_S  30

/** EFUSE_RD_MAC_SPI_SYS_4_REG register
 *  BLOCK1 data register 4.
 */
#define EFUSE_RD_MAC_SPI_SYS_4_REG (DR_REG_EFUSE_BASE + 0x54)
/** EFUSE_FLASH_VENDOR : R; bitpos: [2:0]; default: 0;
 *  Flash vendor
 */
#define EFUSE_FLASH_VENDOR    0x00000007U
#define EFUSE_FLASH_VENDOR_M  (EFUSE_FLASH_VENDOR_V << EFUSE_FLASH_VENDOR_S)
#define EFUSE_FLASH_VENDOR_V  0x00000007U
#define EFUSE_FLASH_VENDOR_S  0
/** EFUSE_PSRAM_CAP : R; bitpos: [4:3]; default: 0;
 *  PSRAM capacity
 */
#define EFUSE_PSRAM_CAP    0x00000003U
#define EFUSE_PSRAM_CAP_M  (EFUSE_PSRAM_CAP_V << EFUSE_PSRAM_CAP_S)
#define EFUSE_PSRAM_CAP_V  0x00000003U
#define EFUSE_PSRAM_CAP_S  3
/** EFUSE_PSRAM_TEMP : R; bitpos: [6:5]; default: 0;
 *  PSRAM temperature
 */
#define EFUSE_PSRAM_TEMP    0x00000003U
#define EFUSE_PSRAM_TEMP_M  (EFUSE_PSRAM_TEMP_V << EFUSE_PSRAM_TEMP_S)
#define EFUSE_PSRAM_TEMP_V  0x00000003U
#define EFUSE_PSRAM_TEMP_S  5
/** EFUSE_PSRAM_VENDOR : R; bitpos: [8:7]; default: 0;
 *  PSRAM vendor
 */
#define EFUSE_PSRAM_VENDOR    0x00000003U
#define EFUSE_PSRAM_VENDOR_M  (EFUSE_PSRAM_VENDOR_V << EFUSE_PSRAM_VENDOR_S)
#define EFUSE_PSRAM_VENDOR_V  0x00000003U
#define EFUSE_PSRAM_VENDOR_S  7
/** EFUSE_RESERVED_1_137 : R; bitpos: [12:9]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_137    0x0000000FU
#define EFUSE_RESERVED_1_137_M  (EFUSE_RESERVED_1_137_V << EFUSE_RESERVED_1_137_S)
#define EFUSE_RESERVED_1_137_V  0x0000000FU
#define EFUSE_RESERVED_1_137_S  9
/** EFUSE_K_RTC_LDO : R; bitpos: [19:13]; default: 0;
 *  BLOCK1 K_RTC_LDO
 */
#define EFUSE_K_RTC_LDO    0x0000007FU
#define EFUSE_K_RTC_LDO_M  (EFUSE_K_RTC_LDO_V << EFUSE_K_RTC_LDO_S)
#define EFUSE_K_RTC_LDO_V  0x0000007FU
#define EFUSE_K_RTC_LDO_S  13
/** EFUSE_K_DIG_LDO : R; bitpos: [26:20]; default: 0;
 *  BLOCK1 K_DIG_LDO
 */
#define EFUSE_K_DIG_LDO    0x0000007FU
#define EFUSE_K_DIG_LDO_M  (EFUSE_K_DIG_LDO_V << EFUSE_K_DIG_LDO_S)
#define EFUSE_K_DIG_LDO_V  0x0000007FU
#define EFUSE_K_DIG_LDO_S  20
/** EFUSE_V_RTC_DBIAS20 : R; bitpos: [31:27]; default: 0;
 *  BLOCK1 voltage of rtc dbias20
 */
#define EFUSE_V_RTC_DBIAS20    0x0000001FU
#define EFUSE_V_RTC_DBIAS20_M  (EFUSE_V_RTC_DBIAS20_V << EFUSE_V_RTC_DBIAS20_S)
#define EFUSE_V_RTC_DBIAS20_V  0x0000001FU
#define EFUSE_V_RTC_DBIAS20_S  27

