espressif/esp-idf/components/soc/esp32s3/register/soc/efuse_reg.h
/** EFUSE_RD_MAC_SPI_SYS_5_REG register
 *  BLOCK1 data register 5.
 */
#define EFUSE_RD_MAC_SPI_SYS_5_REG (DR_REG_EFUSE_BASE + 0x58)
/** EFUSE_V_RTC_DBIAS20_1 : R; bitpos: [2:0]; default: 0;
 *  BLOCK1 voltage of rtc dbias20
 */
#define EFUSE_V_RTC_DBIAS20_1    0x00000007U
#define EFUSE_V_RTC_DBIAS20_1_M  (EFUSE_V_RTC_DBIAS20_1_V << EFUSE_V_RTC_DBIAS20_1_S)
#define EFUSE_V_RTC_DBIAS20_1_V  0x00000007U
#define EFUSE_V_RTC_DBIAS20_1_S  0
/** EFUSE_V_DIG_DBIAS20 : R; bitpos: [10:3]; default: 0;
 *  BLOCK1 voltage of digital dbias20
 */
#define EFUSE_V_DIG_DBIAS20    0x000000FFU
#define EFUSE_V_DIG_DBIAS20_M  (EFUSE_V_DIG_DBIAS20_V << EFUSE_V_DIG_DBIAS20_S)
#define EFUSE_V_DIG_DBIAS20_V  0x000000FFU
#define EFUSE_V_DIG_DBIAS20_S  3
/** EFUSE_DIG_DBIAS_HVT : R; bitpos: [15:11]; default: 0;
 *  BLOCK1 digital dbias when hvt
 */
#define EFUSE_DIG_DBIAS_HVT    0x0000001FU
#define EFUSE_DIG_DBIAS_HVT_M  (EFUSE_DIG_DBIAS_HVT_V << EFUSE_DIG_DBIAS_HVT_S)
#define EFUSE_DIG_DBIAS_HVT_V  0x0000001FU
#define EFUSE_DIG_DBIAS_HVT_S  11
/** EFUSE_RESERVED_1_176 : R; bitpos: [18:16]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_176    0x00000007U
#define EFUSE_RESERVED_1_176_M  (EFUSE_RESERVED_1_176_V << EFUSE_RESERVED_1_176_S)
#define EFUSE_RESERVED_1_176_V  0x00000007U
#define EFUSE_RESERVED_1_176_S  16
/** EFUSE_PSRAM_CAP_3 : R; bitpos: [19]; default: 0;
 *  PSRAM capacity bit 3
 */
#define EFUSE_PSRAM_CAP_3    (BIT(19))
#define EFUSE_PSRAM_CAP_3_M  (EFUSE_PSRAM_CAP_3_V << EFUSE_PSRAM_CAP_3_S)
#define EFUSE_PSRAM_CAP_3_V  0x00000001U
#define EFUSE_PSRAM_CAP_3_S  19
/** EFUSE_RESERVED_1_180 : R; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_180    0x00000007U
#define EFUSE_RESERVED_1_180_M  (EFUSE_RESERVED_1_180_V << EFUSE_RESERVED_1_180_S)
#define EFUSE_RESERVED_1_180_V  0x00000007U
#define EFUSE_RESERVED_1_180_S  20
/** EFUSE_WAFER_VERSION_MINOR_HI : R; bitpos: [23]; default: 0;
 *  WAFER_VERSION_MINOR most significant bit
 */
#define EFUSE_WAFER_VERSION_MINOR_HI    (BIT(23))
#define EFUSE_WAFER_VERSION_MINOR_HI_M  (EFUSE_WAFER_VERSION_MINOR_HI_V << EFUSE_WAFER_VERSION_MINOR_HI_S)
#define EFUSE_WAFER_VERSION_MINOR_HI_V  0x00000001U
#define EFUSE_WAFER_VERSION_MINOR_HI_S  23
/** EFUSE_WAFER_VERSION_MAJOR : R; bitpos: [25:24]; default: 0;
 *  WAFER_VERSION_MAJOR
 */
#define EFUSE_WAFER_VERSION_MAJOR    0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_M  (EFUSE_WAFER_VERSION_MAJOR_V << EFUSE_WAFER_VERSION_MAJOR_S)
#define EFUSE_WAFER_VERSION_MAJOR_V  0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_S  24
/** EFUSE_ADC2_CAL_VOL_ATTEN3 : R; bitpos: [31:26]; default: 0;
 *  ADC2 calibration voltage at atten3
 */
#define EFUSE_ADC2_CAL_VOL_ATTEN3    0x0000003FU
#define EFUSE_ADC2_CAL_VOL_ATTEN3_M  (EFUSE_ADC2_CAL_VOL_ATTEN3_V << EFUSE_ADC2_CAL_VOL_ATTEN3_S)
#define EFUSE_ADC2_CAL_VOL_ATTEN3_V  0x0000003FU
#define EFUSE_ADC2_CAL_VOL_ATTEN3_S  26

/** EFUSE_RD_SYS_PART1_DATA0_REG register
 *  Register 0 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA0_REG (DR_REG_EFUSE_BASE + 0x5c)
/** EFUSE_OPTIONAL_UNIQUE_ID : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_M  (EFUSE_OPTIONAL_UNIQUE_ID_V << EFUSE_OPTIONAL_UNIQUE_ID_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_S  0

/** EFUSE_RD_SYS_PART1_DATA1_REG register
 *  Register 1 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA1_REG (DR_REG_EFUSE_BASE + 0x60)
/** EFUSE_OPTIONAL_UNIQUE_ID_1 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_1    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_M  (EFUSE_OPTIONAL_UNIQUE_ID_1_V << EFUSE_OPTIONAL_UNIQUE_ID_1_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_1_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_S  0

/** EFUSE_RD_SYS_PART1_DATA2_REG register
 *  Register 2 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA2_REG (DR_REG_EFUSE_BASE + 0x64)
/** EFUSE_OPTIONAL_UNIQUE_ID_2 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_2    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_M  (EFUSE_OPTIONAL_UNIQUE_ID_2_V << EFUSE_OPTIONAL_UNIQUE_ID_2_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_2_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_S  0

/** EFUSE_RD_SYS_PART1_DATA3_REG register
 *  Register 3 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA3_REG (DR_REG_EFUSE_BASE + 0x68)
/** EFUSE_OPTIONAL_UNIQUE_ID_3 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_3    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_M  (EFUSE_OPTIONAL_UNIQUE_ID_3_V << EFUSE_OPTIONAL_UNIQUE_ID_3_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_3_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_S  0

/** EFUSE_RD_SYS_PART1_DATA4_REG register
 *  Register 4 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA4_REG (DR_REG_EFUSE_BASE + 0x6c)
/** EFUSE_BLK_VERSION_MAJOR : R; bitpos: [1:0]; default: 0;
 *  BLK_VERSION_MAJOR of BLOCK2 change of this bit means users need to update firmware
 */
#define EFUSE_BLK_VERSION_MAJOR    0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_M  (EFUSE_BLK_VERSION_MAJOR_V << EFUSE_BLK_VERSION_MAJOR_S)
#define EFUSE_BLK_VERSION_MAJOR_V  0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_S  0
/** EFUSE_RESERVED_2_130 : R; bitpos: [3:2]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_2_130    0x00000003U
#define EFUSE_RESERVED_2_130_M  (EFUSE_RESERVED_2_130_V << EFUSE_RESERVED_2_130_S)
#define EFUSE_RESERVED_2_130_V  0x00000003U
#define EFUSE_RESERVED_2_130_S  2
/** EFUSE_TEMP_CALIB : R; bitpos: [12:4]; default: 0;
 *  Temperature calibration data
 */
#define EFUSE_TEMP_CALIB    0x000001FFU
#define EFUSE_TEMP_CALIB_M  (EFUSE_TEMP_CALIB_V << EFUSE_TEMP_CALIB_S)
#define EFUSE_TEMP_CALIB_V  0x000001FFU
#define EFUSE_TEMP_CALIB_S  4
/** EFUSE_OCODE : R; bitpos: [20:13]; default: 0;
 *  ADC OCode
 */
#define EFUSE_OCODE    0x000000FFU
#define EFUSE_OCODE_M  (EFUSE_OCODE_V << EFUSE_OCODE_S)
#define EFUSE_OCODE_V  0x000000FFU
#define EFUSE_OCODE_S  13
/** EFUSE_ADC1_INIT_CODE_ATTEN0 : R; bitpos: [28:21]; default: 0;
 *  ADC1 init code at atten0
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN0    0x000000FFU
#define EFUSE_ADC1_INIT_CODE_ATTEN0_M  (EFUSE_ADC1_INIT_CODE_ATTEN0_V << EFUSE_ADC1_INIT_CODE_ATTEN0_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN0_V  0x000000FFU
#define EFUSE_ADC1_INIT_CODE_ATTEN0_S  21
/** EFUSE_ADC1_INIT_CODE_ATTEN1 : R; bitpos: [31:29]; default: 0;
 *  ADC1 init code at atten1
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN1    0x00000007U
#define EFUSE_ADC1_INIT_CODE_ATTEN1_M  (EFUSE_ADC1_INIT_CODE_ATTEN1_V << EFUSE_ADC1_INIT_CODE_ATTEN1_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN1_V  0x00000007U
#define EFUSE_ADC1_INIT_CODE_ATTEN1_S  29

/** EFUSE_RD_SYS_PART1_DATA5_REG register
 *  Register 5 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA5_REG (DR_REG_EFUSE_BASE + 0x70)
/** EFUSE_ADC1_INIT_CODE_ATTEN1_1 : R; bitpos: [2:0]; default: 0;
 *  ADC1 init code at atten1
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN1_1    0x00000007U
#define EFUSE_ADC1_INIT_CODE_ATTEN1_1_M  (EFUSE_ADC1_INIT_CODE_ATTEN1_1_V << EFUSE_ADC1_INIT_CODE_ATTEN1_1_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN1_1_V  0x00000007U
#define EFUSE_ADC1_INIT_CODE_ATTEN1_1_S  0
/** EFUSE_ADC1_INIT_CODE_ATTEN2 : R; bitpos: [8:3]; default: 0;
 *  ADC1 init code at atten2
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN2    0x0000003FU
#define EFUSE_ADC1_INIT_CODE_ATTEN2_M  (EFUSE_ADC1_INIT_CODE_ATTEN2_V << EFUSE_ADC1_INIT_CODE_ATTEN2_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN2_V  0x0000003FU
#define EFUSE_ADC1_INIT_CODE_ATTEN2_S  3
/** EFUSE_ADC1_INIT_CODE_ATTEN3 : R; bitpos: [14:9]; default: 0;
 *  ADC1 init code at atten3
 */
#define EFUSE_ADC1_INIT_CODE_ATTEN3    0x0000003FU
#define EFUSE_ADC1_INIT_CODE_ATTEN3_M  (EFUSE_ADC1_INIT_CODE_ATTEN3_V << EFUSE_ADC1_INIT_CODE_ATTEN3_S)
#define EFUSE_ADC1_INIT_CODE_ATTEN3_V  0x0000003FU
#define EFUSE_ADC1_INIT_CODE_ATTEN3_S  9
/** EFUSE_ADC2_INIT_CODE_ATTEN0 : R; bitpos: [22:15]; default: 0;
 *  ADC2 init code at atten0
 */
#define EFUSE_ADC2_INIT_CODE_ATTEN0    0x000000FFU
#define EFUSE_ADC2_INIT_CODE_ATTEN0_M  (EFUSE_ADC2_INIT_CODE_ATTEN0_V << EFUSE_ADC2_INIT_CODE_ATTEN0_S)
#define EFUSE_ADC2_INIT_CODE_ATTEN0_V  0x000000FFU
#define EFUSE_ADC2_INIT_CODE_ATTEN0_S  15
/** EFUSE_ADC2_INIT_CODE_ATTEN1 : R; bitpos: [28:23]; default: 0;
 *  ADC2 init code at atten1
 */
#define EFUSE_ADC2_INIT_CODE_ATTEN1    0x0000003FU
#define EFUSE_ADC2_INIT_CODE_ATTEN1_M  (EFUSE_ADC2_INIT_CODE_ATTEN1_V << EFUSE_ADC2_INIT_CODE_ATTEN1_S)
#define EFUSE_ADC2_INIT_CODE_ATTEN1_V  0x0000003FU
#define EFUSE_ADC2_INIT_CODE_ATTEN1_S  23
/** EFUSE_ADC2_INIT_CODE_ATTEN2 : R; bitpos: [31:29]; default: 0;
 *  ADC2 init code at atten2
 */
#define EFUSE_ADC2_INIT_CODE_ATTEN2    0x00000007U
#define EFUSE_ADC2_INIT_CODE_ATTEN2_M  (EFUSE_ADC2_INIT_CODE_ATTEN2_V << EFUSE_ADC2_INIT_CODE_ATTEN2_S)
#define EFUSE_ADC2_INIT_CODE_ATTEN2_V  0x00000007U
#define EFUSE_ADC2_INIT_CODE_ATTEN2_S  29

/** EFUSE_RD_SYS_PART1_DATA6_REG register
 *  Register 6 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA6_REG (DR_REG_EFUSE_BASE + 0x74)
/** EFUSE_ADC2_INIT_CODE_ATTEN2_1 : R; bitpos: [2:0]; default: 0;
 *  ADC2 init code at atten2
 */
#define EFUSE_ADC2_INIT_CODE_ATTEN2_1    0x00000007U
#define EFUSE_ADC2_INIT_CODE_ATTEN2_1_M  (EFUSE_ADC2_INIT_CODE_ATTEN2_1_V << EFUSE_ADC2_INIT_CODE_ATTEN2_1_S)
#define EFUSE_ADC2_INIT_CODE_ATTEN2_1_V  0x00000007U
#define EFUSE_ADC2_INIT_CODE_ATTEN2_1_S  0
/** EFUSE_ADC2_INIT_CODE_ATTEN3 : R; bitpos: [8:3]; default: 0;
 *  ADC2 init code at atten3
 */
#define EFUSE_ADC2_INIT_CODE_ATTEN3    0x0000003FU
#define EFUSE_ADC2_INIT_CODE_ATTEN3_M  (EFUSE_ADC2_INIT_CODE_ATTEN3_V << EFUSE_ADC2_INIT_CODE_ATTEN3_S)
#define EFUSE_ADC2_INIT_CODE_ATTEN3_V  0x0000003FU
#define EFUSE_ADC2_INIT_CODE_ATTEN3_S  3
/** EFUSE_ADC1_CAL_VOL_ATTEN0 : R; bitpos: [16:9]; default: 0;
 *  ADC1 calibration voltage at atten0
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN0    0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN0_M  (EFUSE_ADC1_CAL_VOL_ATTEN0_V << EFUSE_ADC1_CAL_VOL_ATTEN0_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN0_V  0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN0_S  9
/** EFUSE_ADC1_CAL_VOL_ATTEN1 : R; bitpos: [24:17]; default: 0;
 *  ADC1 calibration voltage at atten1
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN1    0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN1_M  (EFUSE_ADC1_CAL_VOL_ATTEN1_V << EFUSE_ADC1_CAL_VOL_ATTEN1_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN1_V  0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN1_S  17
/** EFUSE_ADC1_CAL_VOL_ATTEN2 : R; bitpos: [31:25]; default: 0;
 *  ADC1 calibration voltage at atten2
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN2    0x0000007FU
#define EFUSE_ADC1_CAL_VOL_ATTEN2_M  (EFUSE_ADC1_CAL_VOL_ATTEN2_V << EFUSE_ADC1_CAL_VOL_ATTEN2_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN2_V  0x0000007FU
#define EFUSE_ADC1_CAL_VOL_ATTEN2_S  25

/** EFUSE_RD_SYS_PART1_DATA7_REG register
 *  Register 7 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA7_REG (DR_REG_EFUSE_BASE + 0x78)
/** EFUSE_ADC1_CAL_VOL_ATTEN2_1 : R; bitpos: [0]; default: 0;
 *  ADC1 calibration voltage at atten2
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN2_1    (BIT(0))
#define EFUSE_ADC1_CAL_VOL_ATTEN2_1_M  (EFUSE_ADC1_CAL_VOL_ATTEN2_1_V << EFUSE_ADC1_CAL_VOL_ATTEN2_1_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN2_1_V  0x00000001U
#define EFUSE_ADC1_CAL_VOL_ATTEN2_1_S  0
/** EFUSE_ADC1_CAL_VOL_ATTEN3 : R; bitpos: [8:1]; default: 0;
 *  ADC1 calibration voltage at atten3
 */
#define EFUSE_ADC1_CAL_VOL_ATTEN3    0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN3_M  (EFUSE_ADC1_CAL_VOL_ATTEN3_V << EFUSE_ADC1_CAL_VOL_ATTEN3_S)
#define EFUSE_ADC1_CAL_VOL_ATTEN3_V  0x000000FFU
#define EFUSE_ADC1_CAL_VOL_ATTEN3_S  1
/** EFUSE_ADC2_CAL_VOL_ATTEN0 : R; bitpos: [16:9]; default: 0;
 *  ADC2 calibration voltage at atten0
 */
#define EFUSE_ADC2_CAL_VOL_ATTEN0    0x000000FFU
#define EFUSE_ADC2_CAL_VOL_ATTEN0_M  (EFUSE_ADC2_CAL_VOL_ATTEN0_V << EFUSE_ADC2_CAL_VOL_ATTEN0_S)
#define EFUSE_ADC2_CAL_VOL_ATTEN0_V  0x000000FFU
#define EFUSE_ADC2_CAL_VOL_ATTEN0_S  9
/** EFUSE_ADC2_CAL_VOL_ATTEN1 : R; bitpos: [23:17]; default: 0;
 *  ADC2 calibration voltage at atten1
 */
#define EFUSE_ADC2_CAL_VOL_ATTEN1    0x0000007FU
#define EFUSE_ADC2_CAL_VOL_ATTEN1_M  (EFUSE_ADC2_CAL_VOL_ATTEN1_V << EFUSE_ADC2_CAL_VOL_ATTEN1_S)
#define EFUSE_ADC2_CAL_VOL_ATTEN1_V  0x0000007FU
#define EFUSE_ADC2_CAL_VOL_ATTEN1_S  17
/** EFUSE_ADC2_CAL_VOL_ATTEN2 : R; bitpos: [30:24]; default: 0;
 *  ADC2 calibration voltage at atten2
 */
#define EFUSE_ADC2_CAL_VOL_ATTEN2    0x0000007FU
#define EFUSE_ADC2_CAL_VOL_ATTEN2_M  (EFUSE_ADC2_CAL_VOL_ATTEN2_V << EFUSE_ADC2_CAL_VOL_ATTEN2_S)
#define EFUSE_ADC2_CAL_VOL_ATTEN2_V  0x0000007FU
#define EFUSE_ADC2_CAL_VOL_ATTEN2_S  24
/** EFUSE_RESERVED_2_255 : R; bitpos: [31]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_2_255    (BIT(31))
#define EFUSE_RESERVED_2_255_M  (EFUSE_RESERVED_2_255_V << EFUSE_RESERVED_2_255_S)
#define EFUSE_RESERVED_2_255_V  0x00000001U
#define EFUSE_RESERVED_2_255_S  31

/** EFUSE_RD_USR_DATA0_REG register
 *  Register 0 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA0_REG (DR_REG_EFUSE_BASE + 0x7c)
/** EFUSE_USR_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  Stores the zeroth 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA0    0xFFFFFFFFU
#define EFUSE_USR_DATA0_M  (EFUSE_USR_DATA0_V << EFUSE_USR_DATA0_S)
#define EFUSE_USR_DATA0_V  0xFFFFFFFFU
#define EFUSE_USR_DATA0_S  0

/** EFUSE_RD_USR_DATA1_REG register
 *  Register 1 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA1_REG (DR_REG_EFUSE_BASE + 0x80)
/** EFUSE_USR_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  Stores the first 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA1    0xFFFFFFFFU
#define EFUSE_USR_DATA1_M  (EFUSE_USR_DATA1_V << EFUSE_USR_DATA1_S)
#define EFUSE_USR_DATA1_V  0xFFFFFFFFU
#define EFUSE_USR_DATA1_S  0

/** EFUSE_RD_USR_DATA2_REG register
 *  Register 2 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA2_REG (DR_REG_EFUSE_BASE + 0x84)
/** EFUSE_USR_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  Stores the second 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA2    0xFFFFFFFFU
#define EFUSE_USR_DATA2_M  (EFUSE_USR_DATA2_V << EFUSE_USR_DATA2_S)
#define EFUSE_USR_DATA2_V  0xFFFFFFFFU
#define EFUSE_USR_DATA2_S  0

